Autodesk.Revit.DB.Plumbing.PipeInsulation.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Double)
Creates a new instance of pipe insulation.
document:
The document.
pipeOrContentElementId:
The pipe, fitting, accessory ElementId to which insulation will be added.
pipeInsulationTypeId:
The pipe insulation type.
If the input pipe insulation type is InvalidElementId, the default insulation type from the document will be used.
Thickness:
The thickness of the insulation.
Returns:
The newly created pipe insulation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This id does not represent a pipe, fitting, or accessory element.
-or-
This pipe insulation type is invalid.
-or-
Thickness is not valid for assignment to insulation or lining elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeInsulation
Represents insulation applied to the outside of a given pipe, fitting or content.
Since:
2012